function cfg = config()

% ======================
% 几何参数 % 示例值（需根据实际实验修改）
% ======================
cfg.al1 = 50;  %光源入射坐标到坐标原点的俯仰角
cfg.be1 = -10;  %光源入射坐标到坐标原点的水平角
cfg.al2 = 80;  %探测器像面中心坐标到坐标原点的俯仰角
cfg.be2 = 180;  %探测器像面中心坐标到坐标原点的水平角

cfg.e = 1;  %探测器到目标的距离
cfg.d = 1;  %光源到目标的距离

% ======================
% 材料参数 % 示例值（需根据实际实验修改）
% ======================
cfg.roughness = 0.18;  %粗糙度

% ======================
% 光源（室内LED）% 示例值（需根据实际实验修改）
% ======================
cfg.P_LED = 3;  %LED 电功率
cfg.theta = 120;  %LED 发散角

% ======================
% 数据路径（只改这里！！）
% ======================
cfg.excel_path = 'data/input.xlsx';

end